"""
Напишите программу принимающую ввод информации о треке(место в чарте,исполнитель, название) пока пользователь
не введет "off". Программа должна вывести всю информацию в виде словаря вида: {(место,испонитель): название трека}
"""
a = dict()
b = input('Введите название: ')
c = input('Введите место в чарте: ')
a['b', 'c'] = input()

print(a)

